package main

import "fmt"

func main() {
	// Первая программа, способы вывода
	/*
		fmt.Print("Фильм: ")
		fmt.Println("Интерстеллар")
		fmt.Println("Жанр: Фантастика\nГод:", 2014)
		fmt.Printf("Рейтинг: %.1f, Длительность %d минут", 8.6, 169)
	*/

	// Переменные
	// через var объявляются вне функции, через := работает только внутри функций
	var year int64 = 2014
	var rating = 8.6
	film := "Интерстеллар"

	fmt.Printf("Фильм: %s\nЖанр: Фантастика\nГод:%d", film, year)
	fmt.Printf("Рейтинг: %.1f, Длительность %d минут", rating, 169)
}
